app/controllers/exam_management_controller.rb

  def show_all_subjects
    @subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"

  def show_all_locations
    @locations = Location.all
---
SELECT "locations".* FROM "locations"

  def add_new_location
    @location = Location.create(params[:location])
---
INSERT INTO "locations" ("building", "created_at", "room_no", "total_table", "updated_at") VALUES (?, ?, ?, ?, ?)

  def show_subject_detail
    @subject = Subject.find(params[:dsub])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."s_id" = ? LIMIT 1  [["s_id", "cn201"]]